lib/EWS_Calls/getEmailAttachmentIds.xml

<?xml version="1.0" encoding="utf-8"?> <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Header>
	<t:RequestServerVersion Version="REPLACE_EXCHANGE_VERSION" />
</soap:Header>
<soap:Body>
	<GetItem xmlns="http://schemas.microsoft.com/exchange/services/2006/messages" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types">
		<ItemShape>
			<t:BaseShape>IdOnly</t:BaseShape>
			<t:AdditionalProperties>
				<t:FieldURI FieldURI="item:Attachments" />
			</t:AdditionalProperties>
		</ItemShape>
		<ItemIds>
			REPLACE_ITEM_IDS
		</ItemIds>
	</GetItem>
</soap:Body>
</soap:Envelope>